/**
	\file
    \brief Главный файл программы
	\author SavaLione
*/
//-----------------------------------------------------------------------------
#include <Windows.h>
#include <iostream>
#include <cstring>

#include <string>
#include "..\io\Settings.h"
#include "Net.h"

using namespace std;
//-----------------------------------------------------------------------------
#include "Radix.h"

/**
	\return Код завершения программы
	Вызов программы компилятором
*/
int main() {
	Radix(); ///< Запуск программы
	//-----------------------------------------------------------------------------
	char buff[] = "127.127.127.127";

	cout << buff << endl;
	cout << strchr(buff, '.') << endl;
	cout << *strchr(buff, '.') << endl;
	system("pause"); ///< Пауза до нажатия любой клавиши
	//-----------------------------------------------------------------------------
	return 0;
}